---
type: DataConversionMonitorScope
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# DataConversionMonitorScope

`Autodesk.Revit.DB.DataConversionMonitorScope` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DataConversionMonitorScope | 2016 | `public DataConversionMonitorScope ( IDataConversionMonitor IDCM )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |